src/Documents/ВводОстатков/ВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатков</name>
  <registerRecords>InformationRegister.РС_Остатки_ДС_ПоВидуНакопления</registerRecords>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводОстатковДС</name>
    <attributes>
      <name>МестоХраненияДС</name>
      <type>
        <types>CatalogRef.ИсточникХраненияДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/РС_Остатки_ДС_ПоВидуНакопления/РС_Остатки_ДС_ПоВидуНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РС_Остатки_ДС_ПоВидуНакопления</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидИсточникаЗраненияДС</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВводОстатков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РС_Остатки_ДС_ПоВидуНакопления.Записывать = Истина;
	Для Каждого ТекСтрокаВводОстатковДС Из ВводОстатковДС Цикл
		Движение = Движения.РС_Остатки_ДС_ПоВидуНакопления.Добавить();
		Движение.Период = Дата;
		Движение.ВидИсточникаЗраненияДС = ТекСтрокаВводОстатковДС.МестоХраненияДС;
		Движение.СуммаОстаток = ТекСтрокаВводОстатковДС.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОбщаяСумма = ВводОстатковДС.Итог("Сумма");
КонецПроцедуры
